app/controllers/api/authentications_controller.rb

SELECT "system_users".* FROM "system_users" WHERE "system_users"."user_name" = ? LIMIT ?  [["user_name", "team_user_4"], ["LIMIT", 1]]
---
        def login
            user = SystemUser.find_by(user_name: params[:user_name])