app/controllers/api/teams_controller.rb

        def create
            team = Team.new(team_params)
            wallet = Wallet.new(name: "Wallet of #{user.name}")

            ActiveRecord::Base.transaction do
                if wallet.save
                    team.wallet_id = wallet.id
                    team.system_user_id = decode_token(request.headers['Authorization'])['user_id']

                    if team.save
---
INSERT INTO "wallets" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Wallet of Team A"], ["created_at", "2023-11-26 03:22:52.351948"], ["updated_at", "2023-11-26 03:22:52.351948"]]
INSERT INTO "wallets" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Wallet of Team A"], ["created_at", "2023-11-26 03:17:19.196645"], ["updated_at", "2023-11-26 03:17:19.196645"]]