app/controllers/api/users_controller.rb

        def create
            user = User.new(user_params)
            wallet = Wallet.new(name: "Wallet of #{user.name}")

            ActiveRecord::Base.transaction do
                if wallet.save
                    user.wallet_id = wallet.id
                    user.system_user_id = decode_token(request.headers['Authorization'])['user_id']

                    if user.save
---
INSERT INTO "wallets" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Wallet of Sang mr3"], ["created_at", "2023-11-27 07:26:42.471364"], ["updated_at", "2023-11-27 07:26:42.471364"]]
INSERT INTO "wallets" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Wallet of Sang mr"], ["created_at", "2023-11-25 16:19:00.629507"], ["updated_at", "2023-11-25 16:19:00.629507"]]