app/controllers/api/wallets_controller.rb

        def deposit
            amount = params[:amount].to_f

            if amount <= 0
                render json: { errors: 'Invalid deposit amount. Amount must be greater than 0.' }, status: :unprocessable_entity
                return
            end

            begin
                ActiveRecord::Base.transaction do
                    Transaction.create!(
                        source_wallet_id: nil,
                        target_wallet_id: @user.wallet_id,
                        amount: amount,
                        description: params[:description]
                    )
---
INSERT INTO "transactions" ("source_wallet_id", "target_wallet_id", "amount", "description", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

        def withdraw
            amount = params[:amount].to_f

            if amount <= 0
                render json: { errors: 'Invalid withdrawal amount. Amount must be greater than 0.' }, status: :unprocessable_entity
                return
            end

            if @user.wallet.balance < amount
                render json: { errors: 'Insufficient funds for withdrawal' }, status: :unprocessable_entity
                return
            end

            begin
                ActiveRecord::Base.transaction do
                    Transaction.create!(
                        source_wallet_id: @user.wallet_id,
                        target_wallet_id: nil,
                        amount: amount,
                        description: params[:description]
                    )
---
INSERT INTO "transactions" ("source_wallet_id", "target_wallet_id", "amount", "description", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

        def transfer
            amount = params[:amount].to_f
            target_wallet_id = params[:target_wallet_id].to_i

            if amount <= 0
                render json: { errors: 'Invalid transfer amount. Amount must be greater than 0.' }, status: :unprocessable_entity
                return
            end

            begin
                @user.wallet.transaction do
                    if @user.wallet.balance >= amount
                        # Create a debit transaction for the source wallet
                        @user.wallet.debit_transactions.create!(
                            amount: amount,
                            source_wallet_id: @user.wallet.id,
                            description: "Transfer to wallet #{target_wallet_id}",
                            message: params[:message]
                        )

                        # Create a credit transaction for the target wallet
                        target_wallet = Wallet.find(target_wallet_id)
                        target_wallet.credit_transactions.create!(
                            amount: amount,
                            target_wallet_id: target_wallet_id,
                            description: "Transfer from wallet #{@user.wallet.id}",
                            message: params[:message]
                        )
---
INSERT INTO "transactions" ("source_wallet_id", "target_wallet_id", "amount", "description", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]