app/controllers/application_controller.rb

    def authenticate_user_from_token!
        token = request.headers['Authorization']
        # Check the token is expired or not
        if Time.now.to_i > decode_token(token)['exp']
            render json: { error: 'Token expired' }, status: :unauthorized
            return
        end

        if token && (decoded_token = decode_token(token)) && (user = SystemUser.find_by(id: decoded_token['user_id']))
---
SELECT "system_users".* FROM "system_users" WHERE "system_users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]