app/models/system_user.rb

    def authenticate(username, password)
        user = SystemUser.find_by(user_name: username)
---
SELECT "system_users".* FROM "system_users" WHERE "system_users"."user_name" = ? LIMIT ?  [["user_name", "team_user_4"], ["LIMIT", 1]]